{        
  "DataList":[
    {
    "id":1,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-rangeman-multiband-6-atomic-timekeeping-digita-dial-black-resin-mens-watch-gw94001.jpg",
    "watchName":"G-Shock Rangeman Multi-Band 6 Atomic Timekeeping Digital Dial",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Black resin case with a black resin strap. Fixed black resin bezel. Digital dial displaying: hours, minutes, seconds, date and day of the week. Dial Type: Analog. Luminescent auto led. Quartz movement. Scratch resistant mineral crystal. Solid case back. Case size: 53 mm. Case thickness: 18 mm. Round case shape. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, day, hour, minute, second, solar powered. Additional Info: igital compass, altimeter, barometer, thermometer, sunrise and sunset date, time stamp, mb6 atomic timekeeping, suitable for recreational scuba diving. Casual watch style. Item Variations: GW9400 1, GW9400.1, GW94001. Casio G-Shock Rangeman Multi-Band 6 Atomic Timekeeping Digital Dial Men's Watch GW9400-1.",
    "price":209,
    "techType":"Digital",
    "type":"Watch",
    "material":"Resin"
    },
    {
      "id":2,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-world-time-chronograph-quartz-analogdigital-watch-ga700sk1.jpg",
      "watchName":"G-Shock World Time Chronograph Quartz Analog-Digital Watch",
      "gender":"Men",
      "watchColor":"Black",
      "description":"Transparent resin case and strap. Fixed black resin bezel with a transparent resin ring. Silver dial with luminous black hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog-digital. Luminescent hands. Complete calendar. Function sub-dial. Digital display showing: date and day of the week. Casio calibre 5522 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape. Case dimensions: 57.5 mm x 53.4 mm. Case thickness: 18.1 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: full calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, shock resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock World Time Chronograph Quartz Analog-Digital Watch GA700SK-1.",
      "price":74,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"
    },
    {
      "id":3,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-perpetual-alarm-world-time-chronograph-quartz-analogdigital-black-dial-mens-watch-ga1001a1.jpg",
      "watchName":"G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital",
      "gender":"Men",
      "watchColor":"Black",
      "description":"Black resin case and strap. Fixed black bezel. Black dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog-digital. Luminescent hands and markers. Perpetual calendar. One subdial displaying: small second. Casio Calibre 5081 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 55 × 51.2 mm, case thickness: 16.9 mm. Band width: 20 mm, band length: Men's standard. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, hour, minute, second, shock resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital Black Dial Men's Watch GA-100-1A1.",
      "price":70,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"
    },
    {
      "id":4,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-chronograph-analogdigital-black-dial-mudmaster-mens-watch-ggb1001a9.jpg",
      "watchName":"G-Shock Chronograph Analog-Digital Black Dial Mudmaster",
      "gender":"Men",
      "watchColor":"Black",
      "description":"Black resin case and strap. Fixed black bezel. Black dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog-digital. Luminescent hands and markers. Perpetual calendar. One subdial displaying: small second. Casio Calibre 5081 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 55 × 51.2 mm, case thickness: 16.9 mm. Band width: 20 mm, band length: Men's standard. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, hour, minute, second, shock resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital Black Dial Men's Watch GA-100-1A1.",
      "price":264,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"

    },
    {
      "id":5,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-perpetual-alarm-world-time-chronograph-quartz-analogdigital-ladies-watch-gmas120sr7a_1.jpg",
      "watchName":"G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital",
      "gender":"Ladies",
      "watchColor":"White",
      "description":"Transparent resin case and strap. Fixed transparent resin bezel. Rose gold dial with rose gold-tone hands and index hour markers. Dial Type: Analog-digital. Perpetual calendar. Chronograph - sub-dials displaying: digital. Casio Calibre 5518 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 49 mm x 45.9 mm, case thickness: 15.8 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, shock resistant, magnetic resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital Ladies Watch GMA-S120SR-7A.",
      "price":89,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"
    },
    {
      "id":6,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-perpetual-alarm-world-time-chronograph-quartz-analogdigital-ladies-watch-gmas120sr7a_1.jpg",
      "watchName":"G-Shock Digital Dial Pink Resin",
      "gender":"Ladies",
      "watchColor":"White",
      "description":"Transparent resin case and strap. Fixed transparent resin bezel. Rose gold dial with rose gold-tone hands and index hour markers. Dial Type: Analog-digital. Perpetual calendar. Chronograph - sub-dials displaying: digital. Casio Calibre 5518 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 49 mm x 45.9 mm, case thickness: 15.8 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, shock resistant, magnetic resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital Ladies Watch GMA-S120SR-7A.",
      "price":89,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"
    },
    {
      "id":7,
      "brand":"Casio",
      "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-baby-g-white-resin-ladies-watch-ba110-7a1_1.jpg",
      "watchName":"Baby G White Resin Ladies Watch",
      "gender":"Ladies",
      "watchColor":"White",
      "description":"Transparent resin case and strap. Fixed transparent resin bezel. Rose gold dial with rose gold-tone hands and index hour markers. Dial Type: Analog-digital. Perpetual calendar. Chronograph - sub-dials displaying: digital. Casio Calibre 5518 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 49 mm x 45.9 mm, case thickness: 15.8 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, shock resistant, magnetic resistant. G-shock Series. Sport watch style. Watch label: Japan Movt. Casio G-Shock Perpetual Alarm World Time Chronograph Quartz Analog-Digital Ladies Watch GMA-S120SR-7A.",
      "price":80,
      "techType":"AnalogDigital",
      "type":"Watch",
      "material":"Resin"

    },
    {
    "id":8,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-baby-g-quartz-digital-dial-ladies-watch-bgd560cr2.jpg",
    "watchName":"Baby G Quartz Digital Dial Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Mint Green",
    "description":"Mint green resin case and strap. Fixed mint green resin bezel. Digital dial displaying: hours, minutes, seconds, am/pm, date and day of the week. Luminescent electro luminescent backlight. Quartz movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Rectangle case shape. Case size: 40 mm. Case thickness: 12.5 mm. Band width: 24 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, day, hour, minute, second. Additional Info: world time. 1/100 second stopwatch, countdown timer, alarms, hourly time signal, full auto calendar. Baby G Series. Casual watch style. Casio Baby G Quartz Digital Dial Ladies Watch BGD-560CR-2.",
    "price":80,
    "techType":"Digital",
    "type":"Watch",
    "material":"Resin"
  },
  {
    "id":9,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-perpetual-alarm-world-time-chronograph-quartz-digital-watch-gd120cm5.jpg",
    "watchName":"Perpetual Alarm World Time Chronograph Quartz Digital Watch",
    "gender":"Unisex",
    "watchColor":"Brown and green",
    "description":"Brown and green camouflage resin case and strap. Fixed brown and green camouflage resin bezel. Digital dial. Dial Type: digital. Luminescent led backlight (super illuminator). Perpetual calendar. Casio Calibre 3427 quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 55 mm x 51.2 mm. Buckle clasp. Water resistant at 200 meters / 660 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, shock resistant. Sport watch style. Watch label: Japan Movt. Casio Perpetual Alarm World Time Chronograph Quartz Digital Watch GD120CM-5.",
    "price":100,
    "techType":"Digital",
    "type":"Watch",
    "material":"Resin"
  },
  {
    "id":10,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-pink-dial-ladies-watch-gmas110np8a.jpg",
    "watchName":"G-Shock Quartz Analog-Digital Pink Dial",
    "gender":"Ladies",
    "watchColor":"Black",
    "description":"Black resin case with a grey resin strap. Fixed black resin bezel. Pink dial with pink hands and index hour markers. Minute markers. Dial Type: Analog-digital. Digital sub-dials. Quartz movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Round case shape. Case size: 50 mm. Case thickness: 15 mm. Band width: 29 mm. Band length: 7.5 inches. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, day, hour, minute, second. G-shock Series. Sport watch style. Casio G-Shock Quartz Analog-Digital Pink Dial Ladies Watch GMAS110NP-8A.",
    "price":136,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Resin"
  },
  {
    "id":11,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-gshock-alarm-world-time-quartz-analogdigital-black-dial-mens-watch-ga9001a.jpg",
    "watchName":"G-Shock Alarm World Time Quartz",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Black resin case and strap. Fixed resin bezel. Black dial with black hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog-digital. Luminescent super led light. Full auto-calendar (to year 2099). Quartz movement. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 52.8 mm x 49.5 mm, case thickness: 16.9 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: hour, minute, second, pm, month, date, day, shock resistant, world time, 29 time zones (48 cities + coordinated universal time), daylight saving on/off, 5 daily alarms (with 1 snooze alarm), 12/24-hour format. G-shock Series. Sport watch style. Casio G-Shock Alarm World Time Quartz Analog-Digital Black Dial Men's Watch GA-900-1A.",
    "price":75,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Resin"
  },
  {
    "id":12,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-g-shock-black-dial-men_s-sand-beige-sports-watch-ga100l-8a.jpg",
    "watchName":"G-Shock Black Dial Men's Sand Beige Sports Watch",
    "gender":"Men",
    "watchColor":"Sand Beige",
    "description":"Sand beige resin case with a sand beige resin bracelet. Fixed sand beige resin bezel. Black dial with silver-tone hands and index hour markers. Dial Type: Analog-digital. Luminescent hands and markers. Day and date display at the 4 o'clock position. Quartz movement. Scratch resistant mineral crystal. Solid case back. Case size: 55 mm x 51.2 mm. Case thickness: 16.9 mm. Round case shape. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, day, month, hour, minute, second, world time, 1/1000-second stopwatch, countdown timer, 5 daily alarms (with 1 snooze alarm), 12/24-hour format. Sport watch style. Casio G-Shock Black Dial Men's Sand Beige Sports Watch GA100L-8A.",
    "price":75,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Resin"
  },
  {
    "id":13,
    "brand":"Casio",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/a/casio-sheen-chronograph-quartz-ladies-watch-shn5016d7adr.jpg",
    "watchName":"Sheen Chronograph Quartz Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Silver-tone stainless steel case and bracelet. Fixed tachymeter scale rose gold-tone stainless steel bezel. Mother of pearl dial with rose gold-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 second, 60 minute and 24 hour. Quartz movement. Solid case back. Round case shape, case size: 40 mm. Deployment with push button release clasp. Water resistant at 50 meters / 165 feet. Functions: chronograph, date, hour, minute, second. Sheen Series. Casual watch style. Watch label: Japan Movt. Item Variations: SHN 5016D 7ADR, SHN.5016D.7ADR, SHN5016D7ADR. Casio Sheen Chronograph Quartz Ladies Watch SHN-5016D-7ADR.",
    "price":90,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":14,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/c/i/citizen-eco-drive-blue-angels-chronograph-mens-watch-at802054l.jpg?width=546&height=546",
    "watchName":"Eco Drive Blue Angels Chronograph Men's Watch",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Fixed blue ion-plated bezel. Blue dial with luminous hands and index hour markers. Minute markers. World time cities. Navigation calculator markings around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Three sub-dials displaying: 60 second, 24 hour and dual 1/100th of a second/day of the week. Eco-Drive H800 Atomic Timekeeping Radio Controlled eco-drive movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Round case shape. Case size: 43 mm. Case thickness: 12 mm. Band width: 22 mm. Band length: 8.5 inches. Fold over clasp with a double push button release. Water resistant at 200 meters / 660 feet. Functions: chronograph, date, hour, minute, second, perpetual calendar, world time. Blue Angels Series. Sport watch style. Watch label: Japan Movt. Item Variations: AT8020 54L, AT8020.54L, AT802054L. Citizen Eco Drive Blue Angels Chronograph Men's Watch AT8020-54L.",
    "price":359,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":15,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-promaster-green-dial-mens-watch-bn015711x.jpg",
    "watchName":"Promaster Green Dial Men's Watch",
    "gender":"Men",
    "watchColor":"Green",
    "description":"Silver-tone stainless steel case with a green rubber strap. Uni-directional rotating silver-tone stainless steel bezel with an inlaid green ring. Green dial with black hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 4 o'clock position. Citizen Caliber Eco-Drive E168 eco-drive movement. Scratch resistant mineral crystal. Screw down crown. Solid case back. Round case shape, case size: 44 mm, case thickness: 11.5 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, hour, minute, second, solar-powered. Promaster Series. Sport watch style. Watch label: Japan Movt. Citizen Promaster Green Dial Men's Watch BN0157-11X.",
    "price":195,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":16,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-promaster-professional-diver-200-meters-ecodrive-mens-watch-bn015109l_1.jpg",
    "watchName":"Promaster Professional Diver 200 Meters Eco-Drive Men's Watch",
    "gender":"Men",
    "watchColor":"Blue",
    "description":"Stainless steel case with a navy blue polyurethane strap. Uni-directional rotating stainless steel bezel with a blue ion-plated ring. Dark blue dial with luminous silver-tone and orange hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 4 o'clock position. Citizen caliber Eco-Drive E168 eco-drive movement. Scratch resistant mineral crystal. Screw down crown. Solid case back. Round case shape. Case size: 44 mm. Case thickness: 12 mm. Band width: 20 mm. Band length: 7.5 inches. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, hour, minute, second. Additional Info: solar power watch. charges with light, never requires battery or battery replacement. ",
    "price":204,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":17,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-promaster-diver-luminous-men_s-watch-bn0200-56e.jpg",
    "watchName":"Promaster Diver Luminous Eco-Drive Men's Watch",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Super titanium case and bracelet. Uni-directional rotating titanium bezel with a black aluminium ring. Black dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Citizen caliber Eco-Drive E168 eco-drive movement. Scratch resistant mineral crystal. Screw down crown. Solid case back. Round case shape. Case size: 44 mm. Case thickness: 12 mm. Band width: 22 mm. Safety fold over clasp with a push button release. Water resistant at 200 meters / 660 feet. Functions: date, hour, minute, second, solar-powered. Sport watch style. Watch label: Japan Movt. Citizen Promaster Diver Luminous Eco-Drive Men's Watch BN0200-56E. ",
    "price":289,
    "techType":"Analog",
    "type":"Watch",
    "material":"Super Titanium"
  },
  {
    "id":18,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-ecodrive-blue-dial-elegant-ladies-watch-em050073l.jpg",
    "watchName":"Eco-Drive Blue Dial Elegant Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel. Blue dial with silver-tone hands and index hour markers. Roman numeral appear at the 6 and 12 o'clock positions. Dial Type: Analog. Citizen caliber Eco-Drive E031 eco-drive movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Round case shape. Case size: 32 mm. Case thickness: 7 mm. Fold over clasp with a push button release. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second. Casual watch style. Watch label: Japan Movt. Citizen Eco-Drive Blue Dial Elegant Ladies Watch EM0500-73L.",
    "price":110,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":19,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-silhouette-crystal-ecodrive-silver-dial-ladies-watch-em098050a.jpg",
    "watchName":"Silhouette Crystal Eco-Drive Silver Dial Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel set with crystals. White dial with silver-tone hands. Roman numerals appear at the 6 and 12 o'clock positions. Dial Type: Analog. Citizen Caliber Eco-Drive E031 eco-drive movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Octagonal case shape. Case size: 23 mm. Band width: 6 mm. Jewelry clasp. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second, solar-powered. Silhouette Crystal Series. Dress watch style. Watch label: Japan Movt. Citizen Silhouette Crystal Eco-Drive Silver Dial Ladies Watch EM0980-50A.",
    "price":200,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":20,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-mickey-mouse-ecodrive-crystal-silver-dial-ladies-watch-fe704452w.jpg",
    "watchName":"Mickey Mouse Eco-Drive Crystal Silver Dial Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"stainless steel bracelet. Fixed yellow gold-tone bezel set with crystals. Silver (Mickey Mouse) dial with yellow gold-tone hands and Roman numeral hour markers. Dial Type: Analog. Citizen caliber J830 eco-drive movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Round case shape. Case size: 36 mm. Case thickness: 9.6 mm. Band width: 14 mm. Deployment clasp. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second. Mickey Mouse Series. Dress watch style. Citizen Mickey Mouse Eco-Drive Crystal Silver Dial Ladies Watch FE7044-52W.",
    "price":250,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":21,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-ecodrive-octagon-diamond-black-dial-watch-bm749559g.jpg",
    "watchName":"Eco-Drive Octagon Diamond Black Dial Watch",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"Black ion-plated stainless steel case and bracelet. Fixed black ion-plated bezel. Black dial with grey hands and diamond hour markers. Dial Type: Analog. Date display at the 3 o'clock position. Citizen caliber Eco-Drive E111 eco-drive movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Octagon case shape. Case size: 41 mm. Case thickness: 9.6 mm. Band width: 22 mm. Deployment clasp. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second, solar-powered. Eco-drive Series. Dress watch style. Watch label: Japan Movt. Citizen Eco-Drive Octagon Diamond Black Dial Watch BM7495-59G.",
    "price":299,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":22,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-quartz-analogdigital-black-dial-watch-jy808514h.jpg",
    "watchName":"Quartz Analog-Digital Black Dial Watch",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"Black ion-plated stainless steel case and bracelet. Fixed black ion-plated bezel. Black dial with grey hands and diamond hour markers. Dial Type: Analog. Date display at the 3 o'clock position. Citizen caliber Eco-Drive E111 eco-drive movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Octagon case shape. Case size: 41 mm. Case thickness: 9.6 mm. Band width: 22 mm. Deployment clasp. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second, solar-powered. Eco-drive Series. Dress watch style. Watch label: Japan Movt. Citizen Eco-Drive Octagon Diamond Black Dial Watch BM7495-59G.",
    "price":564,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":23,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-perpetual-world-time-watch-cb024185x.jpg",
    "watchName":"Perpetual World Time Watch",
    "gender":"Unisex",
    "watchColor":"Silver",
    "description":"Stainless steel case with a silver-tone stainless steel bracelet. Fixed silver-tone stainless steel bezel. Burgundy dial with white hands and Arabic numeral/indexes hour markers. Dial Type: Analog. Luminescent hands and markers. Perpetual calendar. Date, signal reception indicator, summer time indicator subdials. Citizen Caliber Eco-Drive H145 eco-drive movement. Scratch resistant sapphire crystal. Solid case back. Round case shape, case size: 42.4 mm. Functions: perpetual calendar, atomic timekeeping, radio controlled, world time, date, GMT, second time zone, hour, minute, second, solar-powered. Watch label: Japan Movt. Citizen Perpetual World Time Watch CB0241-85X.",
    "price":435,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":24,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-diamond-mother-of-pearl-dial-ladies-watch-em088054d.jpg",
    "watchName":"Diamond Mother of Pearl Dial ",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel set with diamonds. Mother of pearl dial with silver-tone hands and Roman numeral hour markers. Minute markers around the outer rim. Dial Type: Analog. Citizen caliber E033 eco-drive movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Round case shape. Case size: 32 mm. Band width: 15 mm. Deployment clasp. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second. Dress watch style. Watch label: Japan Movt. Citizen Diamond Mother of Pearl Dial Ladies Watch EM0880-54D.",
    "price":499,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":25,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-ecodrive-chronograph-blue-dial-mens-watch-at119087l.jpg",
    "watchName":"Eco-Drive Chronograph Blue Dial",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Silver-tone stainless steel case and bracelet. Fixed silver-tone stainless steel bezel. Blue dial with black hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Date display at the 4 o'clock position. Chronograph - three sub-dials displaying: 60 second, 30 minute and 24 hour. Caliber H570 eco-drive movement with a 150-day power reserve. Scratch resistant mineral crystal. Solid case back. Round case shape, case size: 42 mm, case thickness: 11 mm. Band width: 22 mm. Fold over clasp with a safety release. Water resistant at 100 meters / 330 feet. Functions: chronograph, hour, minute, second. Sport watch style. Watch label: Japan Movt. Citizen Eco-Drive Chronograph Blue Dial Men's Watch AT1190-87L.",
    "price":195,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":26,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-silhouette-crystal-ecodrive-silver-dial-ladies-watch-em098050a.jpg",
    "watchName":"Silhouette Crystal Eco-Drive Silver Dial Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel set with crystals. White dial with silver-tone hands. Roman numerals appear at the 6 and 12 o'clock positions. Dial Type: Analog. Citizen Caliber Eco-Drive E031 eco-drive movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Octagonal case shape. Case size: 23 mm. Band width: 6 mm. Jewelry clasp. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second, solar-powered. Silhouette Crystal Series. Dress watch style. Watch label: Japan Movt. Citizen Silhouette Crystal Eco-Drive Silver Dial Ladies Watch EM0980-50A.",
    "price":200,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":27,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-black-panther-ecodrive-black-dial-mens-watch-aw166850w_1.jpg",
    "watchName":"Black Panther Eco-Drive Black Dial Men's Watch",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Silver-tone titanium case and bracelet. Fixed silver-tone titanium bezel. Black dial with purple hands. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Citizen Caliber Eco-Drive J810 eco-drive movement. Scratch resistant sapphire crystal. Solid case back. Round case shape, case size: 41 mm. Band width: 13.8 mm. Fold over clasp with a safety release. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second, solar-powered. Black Panther Series. Dress watch style. Watch label: Japan Movt. Citizen Black Panther Eco-Drive Black Dial Men's Watch AW1668-50W.",
    "price":335,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":28,
    "brand":"Citizen",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-mickey-shadow-ecodrive-white-dial-unisex-watch-bv113003w_1.jpg",
    "watchName":"Mickey Shadow Eco-Drive White Dial Unisex Watch",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"Silver-tone stainless steel case with a black leather strap. Fixed silver-tone stainless steel bezel. White dial with black hands and index hour markers. Dial Type: Analog. Date display at the 3 o'clock position. Sub second hand subdials. Eco-drive movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. Round case shape, case size: 40 mm. Band width: 20 mm. Buckle clasp. Water resistant at 50 meters / 165 feet. Functions: date, hour, minute, sub second hand. Mickey Shadow Series. Casual watch style. Watch label: Japan Movt. Citizen Mickey Shadow Eco-Drive White Dial Unisex Watch BV1130-03W.",
    "price":166,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":29,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/90172AL01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Titan Evoke",
    "gender":"Unisex",
    "watchColor":"Brown",
    "description":"Titan Evoke with large with 1.43inch AMOLED Display 1000 Nits Brightness, SingleSync, BT Calling, AI Voice Assistant, IP68 Water Resistance, Auto Stress and Mood Monitoring AI Voice Assistant with Black Colour Strap. Aluminium case with Mineral Glass. Round case shape. Case size: 47 mm, Case thickness: 12.3 mm  Water resistant at IP68.",
    "price":115,
    "techType":"Digital",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":30,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/90165AP01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Titan Talk S",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Titan Talk S with 1.78inch AMOLED Display, Advanced BT Calling, 100+ Sports Modes, Stress & Mood Monitoring.",
    "price":109,
    "techType":"Digital",
    "type":"Watch",
    "material":"Silicone"
  },
  {
    "id":31,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95146KD02_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Titan Raga Ceramics Green Dial Metal Strap Watch",
    "gender":"Ladies",
    "watchColor":"Green",
    "description":"Metal case with Sapphire Crystal. Round case shape. Case size: 29 mm, Case thickness: 7.5 mm  Water resistant at 3 ATM.",
    "price":223,
    "techType":"Analog",
    "type":"Watch",
    "material":"Metal"
  },
  {
    "id":32,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/1805KM03_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Black & Gold Anthracite Dial Stainless Steel Strap Watch",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Black stainless steel case with Mineral Glass. Round case shape. Case size: 42 mm, Case thickness: 11.2 mm  Water resistant at 5 ATM.",
    "price":100,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":33,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95154QM01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Love All Brown Dial Brown Brass Strap Watch",
    "gender":"Ladies",
    "watchColor":"Brown",
    "description":"Brass case with Mineral Glass.Oval case shape. Case size: 20 mm, Case thickness: 6.9 mm  Water resistant at 3 ATM.",
    "price":134,
    "techType":"Analog",
    "type":"Watch",
    "material":"Brass"
  },
  {
    "id":34,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/90110QM01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Mechanical Blue Dial Watch",
    "gender":"Men",
    "watchColor":"Blue",
    "description":"Blue stainless steel case with Mineral Glass Round case shape. Case size: 44 mm, Case thickness: 13.1 mm  Water resistant at 5 ATM.",
    "price":230,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":35,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95129QM01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Animalia",
    "gender":"Ladies",
    "watchColor":"Brown",
    "description":"Stainless steel, stone-studded case with Mineral Glass Round case shape. Case size: 42.6 mm, Case thickness: 7.9 mm, Strap Lug 14 mm,Water resistant at 5 ATM.",
    "price":149,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":36,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95032WM02J_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Raga Moonlight Mother of Pearl Metal Strap Watch",
    "gender":"Ladies",
    "watchColor":"Rose Gold",
    "description":"This analog watch for women features a mother of pearl, round dial, enclosed within a brass case. The dial features plain two hands and white stone markings at the quarter intervals. The stone-studded, rose gold-coloured, stainless steel strap comes with a double pusher clasp. Equipped with 3 ATM water-resistant depth, the watch is user-friendly. It comes with a 24 month warranty.",
    "price":236,
    "techType":"Analog",
    "type":"Watch",
    "material":"Metal"
  },
  {
    "id":37,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/1830QM01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Maritime Watch with Anthracite Dial",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Stainless steel case with Mineral Glass, Analog with Day and Date. Round case shape. Case size: 43.5 mm, Case thickness: 12.45 mm, Strap Lug 14 mm,Water resistant at 5 ATM.",
    "price":216,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":38,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/1696QC03_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Edge Ceramic - Slimmest Ceramic Analog Watch",
    "gender":"Men",
    "watchColor":"Blue",
    "description":"Ceramic case with Sapphire Crystal, Analog with Day and Date. Round case shape. Case size: 40.5 mm, Case thickness: 4.2 mm,Water resistant at 3 ATM.",
    "price":363,
    "techType":"Analog",
    "type":"Watch",
    "material":"Ceramic"
  },
  {
    "id":39,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/1841QC03_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Edge Squircle White Dial Ceramic Strap Watch",
    "gender":"Men",
    "watchColor":"White",
    "description":"Ceramic case with Sapphire Crystal. Rectangular case shape. Case size: 38 mm, Case thickness: 4.5 mm,Water resistant at 3 ATM",
    "price":484,
    "techType":"Analog",
    "type":"Watch",
    "material":"Ceramic"
  },
  {
    "id":40,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95207QD01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Glitz Purple Watch",
    "gender":"Ladies",
    "watchColor":"Purple",
    "description":"Stainless Steel and stone-studded case with Mineral Glass. Heptagon case shape. Metal & Plastic strap Case size: 29 mm, Case thickness: 7 mm,Water resistant at 3 ATM.",
    "price":150,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":41,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95189KC02_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Purple Ceramics Black",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Ceramic case with Mineral Glass. Round case shape. Case size: 38 mm, Case thickness: 4.5 mm,Water resistant at 5 ATM.",
    "price":125,
    "techType":"Analog",
    "type":"Watch",
    "material":"Ceramic"
  },
  {
    "id":42,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95189KC01_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Purple Ceramics white",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Ceramic case with Mineral Glass. Round case shape. Case size: 38 mm, Case thickness: 4.5 mm,Water resistant at 5 ATM.",
    "price":125,
    "techType":"Analog",
    "type":"Watch",
    "material":"Ceramic"
  },
  {
    "id":43,
    "brand":"Titan",
    "imageUrl":"https://staticimg.titan.co.in/Titan/Catalog/95189KC06_1.jpg?impolicy=pqmed&imwidth=640",
    "watchName":"Purple Ceramics Purple",
    "gender":"Ladies",
    "watchColor":"Purple",
    "description":"Ceramic case with Mineral Glass. Round case shape. Case size: 38 mm, Case thickness: 4.5 mm,Water resistant at 5 ATM.",
    "price":125,
    "techType":"Analog",
    "type":"Watch",
    "material":"Ceramic"
  },
  {
    "id":44,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/11/8-1.png",
    "watchName":"Eterno EM2002L Black",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 40 mm, Case thickness: 10 mm. Dial markers: Index. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":96,
    "techType":"Analog",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":45,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/11/9-1.png",
    "watchName":"Eterno EM2002L Brown",
    "gender":"Men",
    "watchColor":"Brown",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 40 mm, Case thickness: 10 mm. Dial markers: Index. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":96,
    "techType":"Analog",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":46,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/11/1-1.png",
    "watchName":"Eterno EM2002L Silver",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and metal  strap, Round case shape. Case size: 40 mm, Case thickness: 10 mm. Dial markers: Index. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":96,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L Stainless Steel"
  },
  {
    "id":47,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/11/2-1.png",
    "watchName":"Eterno EM2002L Gold",
    "gender":"Men",
    "watchColor":"Yellow Gold-plated",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and metal  strap, Round case shape. Case size: 40 mm, Case thickness: 10 mm. Dial markers: Index. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":96,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L Stainless Steel"
  },
  {
    "id":48,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/11/3-1.png",
    "watchName":"Eterno EM2002L Demi",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and metal  strap, Round case shape. Case size: 40 mm, Case thickness: 10 mm. Dial markers: Index. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":96,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L Stainless Steel"
  },
  {
    "id":49,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/09/7-1.png",
    "watchName":"Eterno EM1902L Demi",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and metal  strap, Round case shape. Case size: 41 mm, Case thickness: 10 mm, case width: 195mm. Dial markers: Roman Numeral. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":60,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L Stainless Steel"
  },
  {
    "id":50,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/09/1-4.png",
    "watchName":"Eterno EM1902L Gold and Brown",
    "gender":"Men",
    "watchColor":"Brown",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 41 mm, Case thickness: 10 mm, case width: 195mm. Dial markers: Roman Numeral. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":60,
    "techType":"Analog",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":51,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/09/9-1.png",
    "watchName":"Eterno EM1902L  Gold",
    "gender":"Men",
    "watchColor":"Yellow Gold-plated",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 41 mm, Case thickness: 10 mm, case width: 195mm. Dial markers: Roman Numeral. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":60,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L Stainless Steel"
  },
  {
    "id":52,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/09/9-2.png",
    "watchName":"Eterno EM1902L Gold and Black",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 41 mm, Case thickness: 10 mm, case width: 195mm. Dial markers: Roman Numeral. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":60,
    "techType":"Analog",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":53,
    "brand":"Eterno",
    "imageUrl":"https://eternowatch.com/wp-content/uploads/2020/09/4-1.png",
    "watchName":"Eterno EM1902L Demi Black",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Exquisite design shows the strong and elegant style of men. 316L Stainless Steel case Sapphire Glass and leather  strap, Round case shape. Case size: 41 mm, Case thickness: 10 mm, case width: 195mm. Dial markers: Roman Numeral. Water resistant at 3 ATM. Lifetime battery warranty.",
    "price":60,
    "techType":"Analog",
    "type":"Watch",
    "material":"Leather"
  },
  {
    "id":54,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/t/i/tissot-seastar-1000-automatic-blue-dial-mens-watch-t1204071704100.jpg?width=546&height=546",
    "watchName":"Seastar 1000 Automatic Blue Dial Men's Watch T1204071704100",
    "gender":"Men",
    "watchColor":"Blue",
    "description":"Stainless steel case with a black rubber strap. Uni-directional rotating stainless steel bezel with a black ceramic ring. Blue dial with luminous silver-tone hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display above the 6 o'clock position. Powermatic 80.111 automatic movement, containing 23 Jewels, bitting at 28800 vph, and has a power reserve of approximately 80 hours. Scratch resistant sapphire crystal. Screw down crown. Transparent case back. Round case shape. Case size: 43 mm. Case thickness: 12.7 mm. Band width: 21 mm. Tang clasp. Water resistant at 300 meters / 1000 feet. Functions: date, hour, minute, second. Seastar 1000 Series. Dive watch style. Watch label: Swiss Made. Tissot Seastar 1000 Automatic Blue Dial Men's Watch T1204071704100.",
    "price":470,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":55,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-couturier-powermatic-80-ladies-watch-t035.207.22.031.00.jpg",
    "watchName":"Couturier Powermatic 80 Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a two-tone (silver-tone and yellow gold PVD) stainless steel bracelet. Fixed yellow gold PVD bezel. Silver dial with yellow gold-tone dauphine-style hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Tissot calibre Powermatic 80 (C07.111) automatic movement, based upon ETA 2824-2, containing 23 Jewels, bitting at 21600 vph, and has a power reserve of approximately 80 hours. Scratch resistant sapphire crystal. Transparent case back. Round case shape. Case size: 32 mm. Case thickness: 10 mm. Band width: 18 mm. Butterfly clasp. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second. Luxury watch style. Watch label: Swiss Made. Tissot Couturier Powermatic 80 Ladies Watch T035.207.22.031.00.",
    "price":239,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":56,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-heritage-visodate-black-dial-mens-brown-leather-watch-t1184103605700--.jpg",
    "watchName":"Heritage Visodate Black Dial Brown Leather Men's Watch T1184103605700",
    "gender":"Men",
    "watchColor":"Brown",
    "description":"Antique bronze PVD stainless steel case with a brown (embossed cow) leather strap. Fixed antique bronze PVD bezel. Black dial with gold-tone hands and index hour markers. Arabic numerals mark the 3, 6, 9 and 12 o'clock positions. Minute markers around the outer rim. Dial Type: Analog. Date display at the 3 o'clock position. ETA caliber F06.111 quartz movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Round case shape. Case size: 40 mm. Case thickness: 10.7 mm. Band width: 20 mm. Tang clasp. Water resistant at 30 meters / 100 feet. Functions: date, hour, minute, second. Casual watch style. Watch label: Swiss Made. Tissot Heritage Visodate Black Dial Brown Leather Men's Watch T1184103605700.",
    "price":138,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":57,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-t-race-analog-digital-white-rubber-unisex-watch-t0814201701700_1.jpg",
    "watchName":"T-Race Analog Digital White Rubber Unisex Watch T0814201701700",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Stainless steel case with a white rubber strap. Fixed stainless steel bezel. White dial with luminous black hands and index hour markers. Arabic numerals mark the 3, 9 and 12 o'clock positions. Dial Type: Analog-Digital. Luminescent hands. Perpetual calendar. Digital multi-function sub-dial. ETA caliber E49.301 quartz movement. Scratch resistant sapphire crystal. Screw down crown. Solid case back. Round case shape. Case size: 42 mm. Case thickness: 13.45 mm. Band width: 20 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: perpetual calendar, chronograph, world time, alarm, month, date, day, GMT, second time zone, hour, minute, second, thermometer, barometer, compass, tide indicator. Additional Info: touch screen, stop watch, split time. T-race Series. Sport watch style. Watch label: Swiss Made. Tissot T-Race Analog Digital White Rubber Unisex Watch T0814201701700.",
    "price":169,
    "techType":"AnalogDigital",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":58,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-quickster-mother-of-pearl-dial-striped-nylon-strap-men_s-watch-t0954103711700_1.jpg",
    "watchName":"Quickster Mother of Pearl Dial Striped Nylon 40mm Watch T0954103711700",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Rose gold-tone stainless steel case with a striped nylon strap. Fixed rose gold-tone bezel. Mother of pearl dial with luminous gold-toned hands and index hour markers. An Arabic numeral appears at the 12 o'clock position. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands. Date display at the 6 o'clock position. Quartz movement. Scratch resistant sapphire crystal. Solid case back. Case diameter: 40 mm. Case thickness: 9.12 mm. Round case shape. Strap width: 19 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second. Casual watch style. Watch label: Swiss Made. Tissot Quickster Mother of Pearl Dial Striped Nylon Strap 40mm Watch T0954103711700..",
    "price":124,
    "techType":"Analog",
    "type":"Watch",
    "material":"Nylon"
  },
  {
    "id":59,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-prx-chronograph-automatic-blue-dial-mens-watch-t1374271104100.jpg",
    "watchName":"PRX Chronograph Automatic Blue Dial Men's Watch",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Silver-tone stainless steel case and bracelet. Fixed silver-tone stainless steel bezel. Blue dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display between 4 and 5 o'clock position. Chronograph - three sub-dials displaying: 60 second, 30 minute and 12 hour. Caliber Valjoux A05.H31 automatic movement. Scratch resistant sapphire crystal. Transparent case back. Tonneau case shape, case size: 42 mm, case thickness: 14.5 mm. Band width: 13 mm. Butterfly clasp. Water resistant at 100 meters / 330 feet. Functions: chronograph, date, hour, minute, second. Prx Series. Casual watch style. Watch label: Swiss Made. Tissot PRX Chronograph Automatic Blue Dial Men's Watch T1374271104100.",
    "price":1450,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":60,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-heritage-porto-hand-wind-silver-dial-ladies-watch-t1285051601200-t1285051601200.jpg",
    "watchName":"Heritage Porto Hand Wind Silver Dial Ladies Watch",
    "gender":"Ladies",
    "watchColor":"Black",
    "description":"316L stainless steel case with a black (croco-embossed) leather strap. Fixed stainless steel bezel. Silver dial with black spade-shaped hands and Arabic numeral hour markers. Minute markers around an inner ring. Dial Type: Analog. Small seconds sub-dial. ETA caliber 7001 hand wind movement with a 46-hour power reserve. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Tonneau case shape. Case size: 31.1 mm. Case thickness: 10.47 mm. Band width: 16 mm. Butterfly clasp. Water resistant at 30 meters / 100 feet. Functions: hour, minute, small second. Casual watch style. Watch label: Swiss Made. Tissot Heritage Porto Hand Wind Silver Dial Ladies Watch T128.505.16.012.00.",
    "price":376,
    "techType":"Analog",
    "type":"Watch",
    "material":"316L stainless steel"
  },
  {
    "id":61,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-t-race-black-dial-mens-chronograph-watch-t1154172705100.jpg",
    "watchName":"T-Race Chronograph Quartz Black Dial Men's Watch T1154172705100",
    "gender":"Men",
    "watchColor":"Red",
    "description":"Stainless steel case with a red rubber strap. Fixed black PVD bezel. Black dial with luminous grey hands and index hour markers. Minute markers. Tachymeter markings around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 second, 30 minute and 1/10th of a second. ETA caliber G10.212 quartz movement. Scratch resistant sapphire crystal. Solid case back. Round case shape. Case size: 47.6 mm. Case thickness: 12.3 mm. Band width: 22 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: chronograph, rattrapante, date, hour, minute, small second. Casual watch style. Watch label: Swiss Made. Tissot T-Race Chronograph Quartz Black Dial Men's Watch T1154172705100.",
    "price":395,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":62,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-seastar-chronograph-quartz-blue-dial-mens-watch-t1204171104103-t1204171104103.jpg",
    "watchName":"Seastar Chronograph Quartz Blue Dial Pepsi Bezel ",
    "gender":"Men",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel bracelet. Uni-directional rotating stainless steel bezel with an inlaid red and blue ceramic ring. Blue dial with luminous grey hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display between the 4 and 5 o'clock positions. Chronograph - three sub-dials displaying: 60 second, 30 minute and 1/10th of a second. ETA caliber G10.212 quartz movement. Scratch resistant sapphire crystal. Screw down crown. Solid case back. Round case shape. Case size: 45.5 mm. Case thickness: 12.8 mm. Deployment clasp. Water resistant at 300 meters / 1000 feet. Functions: chronograph, date, hour, minute, second. Seastar Series. Casual watch style. Watch label: Swiss Made. Tissot Seastar Chronograph Quartz Blue Dial Men's Watch T120.417.11.041.03.",
    "price":376,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":63,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-nba-teams-houston-rockets-quartz-black-dial-watch-t1166173605109-t1166173605109.jpg",
    "watchName":"NBA Teams Houston Rockets Quartz Black Dial Watch ",
    "gender":"Men",
    "watchColor":"Black",
    "description":"Black PVD stainless steel case with a black (embossed cow) leather strap. Fixed black PVD bezel. Black (Houston Rockets logo) dial with luminous hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 4 o'clock position. Chronograph - three sub-dials displaying: 60 second, 30 minute and 12 hour. Caliber ETA G10.212 quartz movement. Scratch resistant sapphire crystal. Solid case back. Round case shape. Case size: 45 mm. Case thickness: 11 mm. Band width: 22 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Nba Teams Houston Rockets Series. Casual watch style. Watch label: Swiss Made. Tissot NBA Teams Houston Rockets Quartz Black Dial Watch T116.617.36.051.09.",
    "price":199,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":64,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-t-trend-lovely-silver-dial-ladies-watch-t0580093303100_5.jpg",
    "watchName":"T-Trend Lovely Silver Dial Ladies Watch T0580093303100 ",
    "gender":"Ladies",
    "watchColor":"Yellow Gold-plated",
    "description":"Yellow gold-plated stainless steel case and bracelet. Fixed yellow gold-plated bezel. Silver dial with gold-tone hands and dot hour markers. Dial Type: Analog. Quartz movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Case diameter: 19.5 mm. Case thickness: 5 mm. Round case shape. Band width: 10 mm. Fold over clasp with a push button release. Water resistant at 30 meters / 100 feet. Functions: hour, minute. Dress watch style. Tissot T-Trend Lovely Silver Dial Gold-plated Ladies Watch T0580093303100.",
    "price":275,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":65,
    "brand":"Tissot",
    "imageUrl":"https://cdn2.jomashop.com/media/catalog/product/t/i/tissot-lovely-square-quartz-blue-dial-ladies-watch-t058.109.11.041.00--.jpg",
    "watchName":"Lovely Square Quartz Blue Dial Ladies Watch ",
    "gender":"Ladies",
    "watchColor":"Silver",
    "description":"Stainless steel case with a stainless steel mesh bracelet. Fixed stainless steel bezel. Blue dial with silver-tone hands and index hour markers. Dial Type: Analog. ETA caliber 901.001 quartz movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Cushion case shape. Case size: 20 mm. Case thickness: 7.1 mm. Band width: 9 mm. Jewelry clasp. Water resistant at 30 meters / 100 feet. Functions: hour, minute. Casual watch style. Watch label: Swiss Made. Tissot Lovely Square Quartz Blue Dial Ladies Watch T058.109.11.041.00.",
    "price":220,
    "techType":"Analog",
    "type":"Watch",
    "material":"Stainless Steel"
  },
  {
    "id":66,
    "brand":"DivineCrafts",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/kjabs7k0-0/wall-clock/a/g/e/handpainted-peacock-wall-clock-wc-331-analog-divinecrafts-original-imafyvmxgyhdyefg.jpeg?q=70",
    "watchName":"Handpainted Peacock Wall Clock ",
    "gender":"Unisex",
    "watchColor":"Multicolor",
    "description":"Size: 32.5 cm x 32.5 cm, Mechanism: Quartz, Frame Material: Wooden, Power Source: Battery, Clock Type: Analog, Hour Markers: English Numerals, Character :Peacock.",
    "price":15,
    "techType":"Analog",
    "type":"Clock",
    "material":"Wooden"
  },
  {
    "id":67,
    "brand":"Matiz",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/3/q/p/high-quality-quartz-decorative-classic-wall-clock-20-mt1202-20cm-original-imagppjwjfuzg32k.jpeg?q=70",
    "watchName":"Classic Matiz Wall Clock ",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Size: 32.5 cm x 32.5 cm, Mechanism: Quartz, Frame Material: Wooden, Power Source: Battery, Clock Type: Analog, Hour Markers: English Numerals, Character :Peacock.",
    "price":13,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":68,
    "brand":"Matiz",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/k7usyvk0/wall-clock/f/z/v/lord-ganesha-shape-vintage-wall-clock-bbc4231mauli790-analog-big-original-imafqy8tc4j5by8x.jpeg?q=70",
    "watchName":"Lord Ganesha Shape Vintage Wall Clock",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"This Wall Clock is a Unique design to decorate your wall offer a superlative way to place time on the wall. Size: 24 cm x 33 cm, Mechanism: Quartz, Frame Material: Plastic. Character: Lord Ganesha, Power Source: Battery Powered. ",
    "price":17,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":69,
    "brand":"Titan",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/jy90eq80/wall-clock/e/k/5/wall-clock-w0036pa01-analog-titan-original-imafggfazrddygkz.jpeg?q=70",
    "watchName":"Titan Analog Wall Clock NAW0036PA01",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"The slim hand profiles and slender markings on the dial give a minimalistic look to this clock. Size: 30 cm x 30 cm. Mechanism: Silent Sweep. Frame Material: Plastic. Power Source: Battery. ",
    "price":20,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":70,
    "brand":"Titan",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/jyeq64w0/wall-clock/h/t/p/wall-clock-w0002pa01-analog-titan-original-imafgnyjvfbpfwyc.jpeg?q=70",
    "watchName":"Titan Analog Wall Clock NBW0002PA01",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Its indices are stylish and embossed to enhance the decor of your home. Size: 30.5 cm x 30.5 cm. Mechanism: Silent Sweep. Frame Material: Plastic. ",
    "price":21,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":71,
    "brand":"Titan",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/k7m8brk0/wall-clock/6/y/5/wall-clock-w0043pa01-analog-titan-original-imafptdzty4gztnh.jpeg?q=70",
    "watchName":"Titan Analog Wall clock NBW0043PA01A",
    "gender":"Unisex",
    "watchColor":"Grey",
    "description":"Size: 29.5 cm x 29.5 cm. Mechanism: Quartz. Frame Material: Plastic, Hour Markers: English Numerals. Weight: 600 g. Other Features: Silent Sweep. ",
    "price":18,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":72,
    "brand":"Kadio",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/f/v/k/square-wall-clock-25-kd2020cola-analog-kadio-25-original-imagkpjasvvxutjt.jpeg?q=70",
    "watchName":"Kadio Square wall clock",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"This beautiful wall clock by Kadio is made up with Plastic which gives your home a vintage look. Size: 25 cm x 25 cm. Frame Material: Plastic. ",
    "price":10,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":73,
    "brand":"Kadio",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/l2tcfbk0/wall-clock/p/o/a/designer-107-cola-analog-kadio-original-image2g85dtfz3yk.jpeg?q=70",
    "watchName":"Kadio Handcrafted Wall Clock",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"This beautiful wall clock by Kadio is made up with Plastic which gives your home a vintage look. Size: 25 cm x 25 cm. Frame Material: Plastic. ",
    "price":19,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":74,
    "brand":"Kadio",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/g/r/g/round-wall-clock-22-kd5003pink-analog-kadio-22-original-imagmffceyztrtvj.jpeg?q=70",
    "watchName":"Kadio Round Wall Clock Pink",
    "gender":"Unisex",
    "watchColor":"White",
    "description":"Size: 22 cm x 22 cm. Frame Material: Plastic. Power Source: AA battery. ",
    "price":11,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":75,
    "brand":"Kadio",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/x/b/q/night-glow-32-1010-analog-kadio-32-original-imaggtyctrs8ny6s.jpeg?q=70",
    "watchName":"Kadio Night Glow Clock",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"The clock has a night glow concept as the hands of the clock have a radium touch. Size: 32 cm x 32 cm. Frame Material: Plastic. ",
    "price":14,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":76,
    "brand":"Kadio",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/l4fxh8w0/wall-clock/2/d/p/round-clock-24-5-8108-analog-kadio-24-5-original-imagfckeaf32bpdv.jpeg?q=70",
    "watchName":"Kadio Round Clock",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"The catchy numeric and hands display in an array of colours is what gives a distinguishing look to the clock. Size: 24.5 cm x 24.5 cm. Frame Material: Plastic. ",
    "price":9,
    "techType":"Analog",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":77,
    "brand":"Ajanta",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/kn6cxow0/wall-clock/b/q/4/a-digital-clock-302-green-olc-302-green-digital-ajanta-original-imagfwwk6t46gzkr.jpeg?q=70",
    "watchName":"Ajanta Digital Clock 302 green",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"The catchy numeric and hands display in an array of colours is what gives a distinguishing look to the clock. Size: 24.5 cm x 24.5 cm. Frame Material: Plastic. ",
    "price":25,
    "techType":"Digital",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":78,
    "brand":"Ajanta",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/wall-clock/y/m/w/olc-105-ajanta-digtal-olc-105-original-imadh7cmmyaypgfa.jpeg?q=70",
    "watchName":"Ajanta Digital Wall Clock OLC-105 red",
    "gender":"Unisex",
    "watchColor":"Black",
    "description":"Size: 25.4 cm x 25.4 cm, Frame Material: Plastic. Battery: 2 aa Batteries. Dial Material: Glass. ",
    "price":21,
    "techType":"Digital",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":79,
    "brand":"Ajanta",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/l47cu4w0/wall-clock/s/e/c/lcd-140-16-lcd-140-digital-ajanta-20-original-imagf5j4vk8jxvzp.jpeg?q=70",
    "watchName":"Ajanta Digital Wall Clock  LCD 140",
    "gender":"Unisex",
    "watchColor":"Brown",
    "description":"Jumbo Liquid Crystal Display Wooden Polystyrene Frame Wall mountable and built in stand for descktop display Alarm clock and snooze function Temperature format in Degree C/F select 12/24Hr Date (Date/ Month/ Day) Display LCD Clock (Hour/ minor / Second) Display Key tone sound Low battery Indication. Size: 16 cm x 20 cm. Frame Material: Plastic. ",
    "price":20,
    "techType":"Digital",
    "type":"Clock",
    "material":"Plastic"
  },
  {
    "id":80,
    "brand":"Rujave",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/2/2/1/acrylic-resin-type-printed-round-shaped-wall-clock-for-home-d-original-imagjys2q2psznhr.jpeg?q=70",
    "watchName":"Rujave Digital 25 cm X 25 cm Wall Clock",
    "gender":"Unisex",
    "watchColor":"Green",
    "description":"Acrylic Resin Type Printed Classic Stylish Wall Clock. Size: 25 cm x 25 cm. Frame Material: Metal ",
    "price":22,
    "techType":"Digital",
    "type":"Clock",
    "material":"Metal"
  },
  {
    "id":81,
    "brand":"Rujave",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/s/x/t/round-designer-wall-clock-for-home-living-room-hall-office-original-imagkyyqsgknkwhc.jpeg?q=70",
    "watchName":"Rujave Digital 25 cm X 25 cm Wall Clock Colorfull",
    "gender":"Unisex",
    "watchColor":"Multicolor",
    "description":"The Clocks Are Very Durable Made Up Of Acrylic, Runs On The Power Of Battery and get a stylish and modern look. Size: 25 cm x 25 cm. Frame Material: Metal ",
    "price":21,
    "techType":"Digital",
    "type":"Clock",
    "material":"Metal"
  },
  {
    "id":82,
    "brand":"Rujave",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/z/5/b/genuine-original-round-wall-clock-for-home-living-room-hall-original-imagkyy5tvckhztn.jpeg?q=70",
    "watchName":"Rujave Digital 30 cm X 22 cm Wall Clock ",
    "gender":"Unisex",
    "watchColor":"Blue",
    "description":"Material :-Acrylic ,Size, 25 cm x 25 cm Medium Size for Wall Decoration, acrylic surface let your room get a stylish and modern look. Frame Material: Marble",
    "price":18,
    "techType":"Digital",
    "type":"Clock",
    "material":"Marble"
  },
  {
    "id":83,
    "brand":"Rujave",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/v/e/2/genuine-original-round-wall-clock-for-home-living-room-hall-original-imagkyy5wgmzdffv.jpeg?q=70",
    "watchName":"Rujave Digital 30 cm X 22 cm Wall Clock Pink  ",
    "gender":"Unisex",
    "watchColor":"Pink",
    "description":"Material :-Acrylic ,Size, 25 cm x 25 cm Medium Size for Wall Decoration, acrylic surface let your room get a stylish and modern look. Frame Material: Marble",
    "price":18,
    "techType":"Digital",
    "type":"Clock",
    "material":"Marble"
  },
  {
    "id":84,
    "brand":"Rujave",
    "imageUrl":"https://rukminim1.flixcart.com/image/832/832/xif0q/wall-clock/n/y/f/genuine-original-square-wall-clock-for-home-living-room-hall-original-imagkyy5zzvfuqgx.jpeg?q=70",
    "watchName":"Rujave Digital 30 cm X 22 cm Wall Clock Yellow",
    "gender":"Unisex",
    "watchColor":"Yellow",
    "description":"Material :-Acrylic ,Size, 25 cm x 25 cm Medium Size for Wall Decoration, acrylic surface let your room get a stylish and modern look. Frame Material: Marble",
    "price":22,
    "techType":"Digital",
    "type":"Clock",
    "material":"Marble"
  },{
    "id": 85,
    "brand": "Seiko",
    "imageUrl": "https://cdn2.jomashop.com/media/catalog/product/s/e/seiko-prospex-automatic-blue-dial-men-s-watch-srpd51.jpg",
    "watchName": "Seiko Prospex Automatic Blue Dial",
    "gender": "Men",
    "watchColor": "Blue",
    "description": "Stainless steel case with a stainless steel bracelet. Uni-directional rotating blue stainless steel bezel. Blue dial with silver-tone hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Seiko Calibre 4R36 automatic movement with a 41-hour power reserve. Scratch resistant Hardlex crystal. Screw down crown. Transparent case back. Round case shape, case size: 44 mm, case thickness: 12 mm. Band width: 22 mm. Deployment clasp. Water resistant at 100 meters / 330 feet. Functions: date, hour, minute, second. Casual watch style. Seiko Prospex Automatic Blue Dial Men's Watch SRPD51.",
    "price": 349,
    "techType": "Automatic",
    "type": "Watch",
    "material": "Stainless Steel"
  },{
    "id": 86,
    "brand": "Citizen",
    "imageUrl": "https://cdn2.jomashop.com/media/catalog/product/c/i/citizen-eco-drive-promaster-diver-blue-dial-men-s-watch-bn0191-55l.jpg",
    "watchName": "Citizen Eco-Drive Promaster Diver Blue Dial",
    "gender": "Men",
    "watchColor": "Blue",
    "description": "Stainless steel case with a blue polyurethane strap. Uni-directional rotating blue stainless steel bezel with a blue top ring. Blue dial with luminous silver-tone hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Citizen Calibre Eco-Drive E168 eco-drive movement. Scratch resistant mineral crystal. Screw down crown. Solid case back. Round case shape. Case size: 44 mm. Case thickness: 12 mm. Band width: 20 mm. Tang clasp. Water resistant at 200 meters / 660 feet. Functions: date, hour, minute, second. Sport watch style. Citizen Eco-Drive Promaster Diver Blue Dial Men's Watch BN0191-55L.",
    "price": 215,
    "techType": "Eco-Drive",
    "type": "Watch",
    "material": "Stainless Steel"
  },{
    "id": 87,
    "brand": "Fossil",
    "imageUrl": "https://cdn2.jomashop.com/media/catalog/product/f/o/fossil-machine-automatic-skeleton-dial-men-s-watch-me3104.jpg",
    "watchName": "Fossil Machine Automatic Skeleton Dial",
    "gender": "Men",
    "watchColor": "Silver",
    "description": "Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel. Skeleton dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Automatic movement with a 42-hour power reserve. Scratch resistant mineral crystal. Pull / push crown. Transparent case back. Round case shape, case size: 45 mm, case thickness: 14 mm. Band width: 24 mm. Deployment clasp. Water resistant at 50 meters / 165 feet. Functions: hour, minute, second. Casual watch style. Fossil Machine Automatic Skeleton Dial Men's Watch ME3104.",
    "price": 245,
    "techType": "Automatic",
    "type": "Watch",
    "material": "Stainless Steel"
  }
  ]
}
